//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="تنفيذ الخطوة %d من %d: يتم إنشاء مخزن الكيان";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="تنفيذ الخطوة %d من %d: يتم إنشاء قاعدة بيانات بدء التشغيل";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="تنفيذ الخطوة %d من %d: يتم إنشاء قاعدة بيانات قائمة انتظار الطلب";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="تنفيذ الخطوة %d من %d: يتم تنزيل مخزن الكيان. تم استلام %s من %s حتى الآن.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="تنفيذ الخطوة %d من %d: تتم إزالة الطلبات منتهية الصلاحية";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="تنفيذ الخطوة %d من %d: يتم تحميل بيانات التعريف";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="تنفيذ الخطوة %d من %d: يتم تنفيذ دمج قائمة انتظار الطلب";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="تنفيذ الخطوة %d من %d: يتم تنفيذ دمج المعاملة";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="تنفيذ الخطوة %d من %d: يتم تنفيذ الدمج والحذف والإنشاء";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="تنفيذ الخطوة %d من %d: تتم معالجة تحديد الاستعلامات %s باستخدامات %s";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="تنفيذ الخطوة %d من %d: تتم معالجة الطلبات. يتم إرسال طلب التعديل %s لـ %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="تنفيذ الخطوة %d من %d: تتم إعادة تطبيق التغييرات";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="تنفيذ الخطوة %d من %d: يتم تحليل البيانات المستلمة";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="تنفيذ الخطوة %d من %d: يتم استلام البيانات من الخادم. تم استلام %s حتى الآن.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="تنفيذ الخطوة %d من %d: تتم إزالة العلاقات المحذوفة";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="تنفيذ الخطوة %d من %d: تتم إزالة الطلبات المحددة كـ إزالة بعد التحميل";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="تنفيذ الخطوة %d من %d: يتم إرسال البيانات إلى الخادم. تم إرسال %s حتى الآن.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="تنفيذ الخطوة %d من %d: يتم إرسال قاعدة بيانات مخزن الكيان. تم إرسال %s من %s حتى الآن.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="تنفيذ الخطوة %d من %d: يتم إرسال قاعدة بيانات قائمة انتظار الطلب. تم إرسال %s من %s حتى الآن.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="تنفيذ الخطوة %d من %d: يتم بدء الاتصال بالخادم";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="تنفيذ الخطوة %d من %d: تتم معالجة الطلبات مسبقًا قبل التحميل";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="تنفيذ الخطوة %d من %d: بانتظار التنزيل";
